testcase/fixed_large/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    cellDisplacement
    {
        solver          PCG;
        preconditioner  DIC;

        tolerance       1e-06;
        relTol          0;
        maxIter         100;
    }

    p
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-6;
        relTol          0.1;
    }

    pFinal
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-6;
        relTol          0.1;
    }

    pcorr
    {
        $pFinal;
        solver          PCG;
        preconditioner  DIC;
        tolerance 1e-6;
    }

    pcorrFinal
    {
        $pcorr;
        relTol          0;
        tolerance 1e-6;
    }

    "(U|k|epsilon)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-6;
        relTol          0.1;
    }

    "(U|k|epsilon)Final"
    {
        $U;
        tolerance       1e-6;
        relTol          0.1;
    }

       Phi
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance 1e-6;
        relTol          0;
    };

}

PIMPLE
{
    momentumPredictor   true;
    correctPhi          true;
    oversetAdjustPhi    true;
    nOuterCorrectors    4;
    nCorrectors         2;
    nNonOrthogonalCorrectors 0;
    massFluxInterpolation false;
    ddtCorr             true;
    turbOnFinalIterOnly false;
}

SIMPLE
{
    nNonOrthogonalCorrectors 0;
    pRefCell        0;
    pRefValue       0;

    residualControl
    {
        p               1e-5;
        U               1e-5;
        nuTilda         1e-5;
    }
}
relaxationFactors
{
    fields
    {
        p               0.9;
    }
    equations
    {
        "(U|k|omega)"   1.;
        ".*Final"        1.0;
    }
}


// ************************************************************************* //
