testcase/fixed_large/system/topoSetDictR3
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    
        {
        name    cref3;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
            box (-13.5 -0.05 -4) (-5 0.05 4);
        }
    }
    {
        name    cR3;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        sourceInfo
        {
            set cref3;
        }
    }

);

// ************************************************************************* //
